# SPARK DATAFRAME BASICS

In [1]:
from pyspark.sql import SparkSession

In [2]:
spark = SparkSession.builder.appName("Basics").getOrCreate()

In [3]:
df = spark.read.csv("file:///home/icpl12900/Desktop/assignments/fakefriends.csv")

In [4]:
df.show() #it show data

+---+--------+---+---+
|_c0|     _c1|_c2|_c3|
+---+--------+---+---+
|  0|    Will| 33|385|
|  1|Jean-Luc| 26|  2|
|  2|    Hugh| 55|221|
|  3|  Deanna| 40|465|
|  4|   Quark| 68| 21|
|  5|  Weyoun| 59|318|
|  6|  Gowron| 37|220|
|  7|    Will| 54|307|
|  8|  Jadzia| 38|380|
|  9|    Hugh| 27|181|
| 10|     Odo| 53|191|
| 11|     Ben| 57|372|
| 12|   Keiko| 54|253|
| 13|Jean-Luc| 56|444|
| 14|    Hugh| 43| 49|
| 15|     Rom| 36| 49|
| 16|  Weyoun| 22|323|
| 17|     Odo| 35| 13|
| 18|Jean-Luc| 45|455|
| 19|  Geordi| 60|246|
+---+--------+---+---+
only showing top 20 rows

In [5]:
df.printSchema()

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)

In [9]:
df.columns #show python list of columns name

['_c0', '_c1', '_c2', '_c3']

In [11]:
df.columns[0] #show name of column at index 0

'_c0'

In [16]:
df.describe()

DataFrame[summary: string, _c0: string, _c1: string, _c2: string, _c3: string]

In [17]:
df.describe().show()

+-------+-----------------+----+------------------+-----------------+
|summary|              _c0| _c1|               _c2|              _c3|
+-------+-----------------+----+------------------+-----------------+
|  count|              500| 500|               500|              500|
|   mean|            249.5|null|            43.708|          248.532|
| stddev|144.4818327679989|null|14.864340996711995|147.2217288680643|
|    min|                0| Ben|                18|                1|
|    max|               99|Worf|                69|               99|
+-------+-----------------+----+------------------+-----------------+

# Give Schema for dataFrame

In [25]:
from pyspark.sql.types import (StructField,StringType,
                               IntegerType,StructType)

In [26]:
data_schema = [StructField('ID',IntegerType(),True),
               StructField('NAME',StringType(),True),
               StructField('AGE',IntegerType(),True),
               StructField("FRIENDS",IntegerType(),True)]
#True means it is ok if there is null value in column
#if it is not given if there is null value then it give error

In [27]:
final_struct = StructType(fields=data_schema)

In [28]:
df = spark.read.csv("file:///home/icpl12900/Desktop/assignments/fakefriends.csv",schema=final_struct)

In [29]:
df.printSchema()

root
 |-- ID: integer (nullable = true)
 |-- NAME: string (nullable = true)
 |-- AGE: integer (nullable = true)
 |-- FRIENDS: integer (nullable = true)

# SELECT METHOD

In [30]:
df['age']

Column<age>

In [31]:
type(df['age']) #it show type of column age and here column is object

pyspark.sql.column.Column

In [33]:
df.select('age') #it show column name with data type of that column

DataFrame[age: int]

In [34]:
df.select('age').show() #it show data from that column

+---+
|age|
+---+
| 33|
| 26|
| 55|
| 40|
| 68|
| 59|
| 37|
| 54|
| 38|
| 27|
| 53|
| 57|
| 54|
| 56|
| 43|
| 36|
| 22|
| 35|
| 45|
| 60|
+---+
only showing top 20 rows

##### There are two method :
    1. return COLUMN from dataframe   
            
    2. return dataframe which contain single column
            df.select('age').show()

In [35]:
type(df.select('age')) # it return dataframe of single column

pyspark.sql.dataframe.DataFrame

##### for top two row use head method

In [36]:
df.head(2)

[Row(ID=0, NAME=u'Will', AGE=33, FRIENDS=385),
 Row(ID=1, NAME=u'Jean-Luc', AGE=26, FRIENDS=2)]

In [37]:
type(df.head(2)) 
#for top two rows it return type is "list"

list

In [42]:
type(df.head(2)[0]) 
#from top two , at 1st index there is 1st row from dataframe and type of that row within list is ROW

pyspark.sql.types.Row

In [43]:
df.head(2)[0]

Row(ID=0, NAME=u'Will', AGE=33, FRIENDS=385)

In [45]:
df.head(1) #output is same

[Row(ID=0, NAME=u'Will', AGE=33, FRIENDS=385)]

In [46]:
type(df.head(1)) #but type is different

list

##### If we want more than one column in "select"

In [48]:
df.select(['ID','NAME']) #return Dataframe of two column

DataFrame[ID: int, NAME: string]

In [49]:
df.select(['ID','NAME']).show()

+---+--------+
| ID|    NAME|
+---+--------+
|  0|    Will|
|  1|Jean-Luc|
|  2|    Hugh|
|  3|  Deanna|
|  4|   Quark|
|  5|  Weyoun|
|  6|  Gowron|
|  7|    Will|
|  8|  Jadzia|
|  9|    Hugh|
| 10|     Odo|
| 11|     Ben|
| 12|   Keiko|
| 13|Jean-Luc|
| 14|    Hugh|
| 15|     Rom|
| 16|  Weyoun|
| 17|     Odo|
| 18|Jean-Luc|
| 19|  Geordi|
+---+--------+
only showing top 20 rows

##### withColumn : ==  To add new column in dataframe but this is not inplace operation so it not change original DataFrame

In [50]:
df.withColumn('newAge',df['age']).show() 
#it create newAge column in dataFrame, which have same data as age column

+---+--------+---+-------+------+
| ID|    NAME|AGE|FRIENDS|newAge|
+---+--------+---+-------+------+
|  0|    Will| 33|    385|    33|
|  1|Jean-Luc| 26|      2|    26|
|  2|    Hugh| 55|    221|    55|
|  3|  Deanna| 40|    465|    40|
|  4|   Quark| 68|     21|    68|
|  5|  Weyoun| 59|    318|    59|
|  6|  Gowron| 37|    220|    37|
|  7|    Will| 54|    307|    54|
|  8|  Jadzia| 38|    380|    38|
|  9|    Hugh| 27|    181|    27|
| 10|     Odo| 53|    191|    53|
| 11|     Ben| 57|    372|    57|
| 12|   Keiko| 54|    253|    54|
| 13|Jean-Luc| 56|    444|    56|
| 14|    Hugh| 43|     49|    43|
| 15|     Rom| 36|     49|    36|
| 16|  Weyoun| 22|    323|    22|
| 17|     Odo| 35|     13|    35|
| 18|Jean-Luc| 45|    455|    45|
| 19|  Geordi| 60|    246|    60|
+---+--------+---+-------+------+
only showing top 20 rows

In [52]:
df.show()
#but it doesnot change original DataFrame

+---+--------+---+-------+
| ID|    NAME|AGE|FRIENDS|
+---+--------+---+-------+
|  0|    Will| 33|    385|
|  1|Jean-Luc| 26|      2|
|  2|    Hugh| 55|    221|
|  3|  Deanna| 40|    465|
|  4|   Quark| 68|     21|
|  5|  Weyoun| 59|    318|
|  6|  Gowron| 37|    220|
|  7|    Will| 54|    307|
|  8|  Jadzia| 38|    380|
|  9|    Hugh| 27|    181|
| 10|     Odo| 53|    191|
| 11|     Ben| 57|    372|
| 12|   Keiko| 54|    253|
| 13|Jean-Luc| 56|    444|
| 14|    Hugh| 43|     49|
| 15|     Rom| 36|     49|
| 16|  Weyoun| 22|    323|
| 17|     Odo| 35|     13|
| 18|Jean-Luc| 45|    455|
| 19|  Geordi| 60|    246|
+---+--------+---+-------+
only showing top 20 rows

In [54]:
df.withColumn('newAge',df['age']*2).show() 
#here we create new column with name newAge and value in that column is double value in column age

+---+--------+---+-------+------+
| ID|    NAME|AGE|FRIENDS|newAge|
+---+--------+---+-------+------+
|  0|    Will| 33|    385|    66|
|  1|Jean-Luc| 26|      2|    52|
|  2|    Hugh| 55|    221|   110|
|  3|  Deanna| 40|    465|    80|
|  4|   Quark| 68|     21|   136|
|  5|  Weyoun| 59|    318|   118|
|  6|  Gowron| 37|    220|    74|
|  7|    Will| 54|    307|   108|
|  8|  Jadzia| 38|    380|    76|
|  9|    Hugh| 27|    181|    54|
| 10|     Odo| 53|    191|   106|
| 11|     Ben| 57|    372|   114|
| 12|   Keiko| 54|    253|   108|
| 13|Jean-Luc| 56|    444|   112|
| 14|    Hugh| 43|     49|    86|
| 15|     Rom| 36|     49|    72|
| 16|  Weyoun| 22|    323|    44|
| 17|     Odo| 35|     13|    70|
| 18|Jean-Luc| 45|    455|    90|
| 19|  Geordi| 60|    246|   120|
+---+--------+---+-------+------+
only showing top 20 rows

##### withCoulmnRename  use to rename column name

In [57]:
df.withColumnRenamed('age','my_new_age').show()
#1st give old name then give new name but this is also not inplace operation

+---+--------+----------+-------+
| ID|    NAME|my_new_age|FRIENDS|
+---+--------+----------+-------+
|  0|    Will|        33|    385|
|  1|Jean-Luc|        26|      2|
|  2|    Hugh|        55|    221|
|  3|  Deanna|        40|    465|
|  4|   Quark|        68|     21|
|  5|  Weyoun|        59|    318|
|  6|  Gowron|        37|    220|
|  7|    Will|        54|    307|
|  8|  Jadzia|        38|    380|
|  9|    Hugh|        27|    181|
| 10|     Odo|        53|    191|
| 11|     Ben|        57|    372|
| 12|   Keiko|        54|    253|
| 13|Jean-Luc|        56|    444|
| 14|    Hugh|        43|     49|
| 15|     Rom|        36|     49|
| 16|  Weyoun|        22|    323|
| 17|     Odo|        35|     13|
| 18|Jean-Luc|        45|    455|
| 19|  Geordi|        60|    246|
+---+--------+----------+-------+
only showing top 20 rows

In [58]:
df.show()

+---+--------+---+-------+
| ID|    NAME|AGE|FRIENDS|
+---+--------+---+-------+
|  0|    Will| 33|    385|
|  1|Jean-Luc| 26|      2|
|  2|    Hugh| 55|    221|
|  3|  Deanna| 40|    465|
|  4|   Quark| 68|     21|
|  5|  Weyoun| 59|    318|
|  6|  Gowron| 37|    220|
|  7|    Will| 54|    307|
|  8|  Jadzia| 38|    380|
|  9|    Hugh| 27|    181|
| 10|     Odo| 53|    191|
| 11|     Ben| 57|    372|
| 12|   Keiko| 54|    253|
| 13|Jean-Luc| 56|    444|
| 14|    Hugh| 43|     49|
| 15|     Rom| 36|     49|
| 16|  Weyoun| 22|    323|
| 17|     Odo| 35|     13|
| 18|Jean-Luc| 45|    455|
| 19|  Geordi| 60|    246|
+---+--------+---+-------+
only showing top 20 rows

## SQL Query on DataFrame

In [59]:
df.createOrReplaceTempView('fakefriends')
#here, we register it as SQL temporary view
#This "fakefriends" is a name of this temp view and we can use it to run query on it

In [60]:
result = spark.sql("select * from fakefriends") 
#here, we pass sql query as string to spark which run on temp view fakefriends

In [61]:
result.show()
#it show result

+---+--------+---+-------+
| ID|    NAME|AGE|FRIENDS|
+---+--------+---+-------+
|  0|    Will| 33|    385|
|  1|Jean-Luc| 26|      2|
|  2|    Hugh| 55|    221|
|  3|  Deanna| 40|    465|
|  4|   Quark| 68|     21|
|  5|  Weyoun| 59|    318|
|  6|  Gowron| 37|    220|
|  7|    Will| 54|    307|
|  8|  Jadzia| 38|    380|
|  9|    Hugh| 27|    181|
| 10|     Odo| 53|    191|
| 11|     Ben| 57|    372|
| 12|   Keiko| 54|    253|
| 13|Jean-Luc| 56|    444|
| 14|    Hugh| 43|     49|
| 15|     Rom| 36|     49|
| 16|  Weyoun| 22|    323|
| 17|     Odo| 35|     13|
| 18|Jean-Luc| 45|    455|
| 19|  Geordi| 60|    246|
+---+--------+---+-------+
only showing top 20 rows

In [62]:
new_result = spark.sql("select * from fakefriends where NAME = 'Will'")

In [63]:
new_result.show()

+---+----+---+-------+
| ID|NAME|AGE|FRIENDS|
+---+----+---+-------+
|  0|Will| 33|    385|
|  7|Will| 54|    307|
| 76|Will| 62|    201|
| 98|Will| 44|    178|
|107|Will| 64|    419|
|136|Will| 19|    335|
|164|Will| 31|    172|
|175|Will| 38|    459|
|206|Will| 21|    491|
|215|Will| 22|      6|
|252|Will| 36|    174|
|262|Will| 51|    334|
|275|Will| 47|     13|
|304|Will| 19|    404|
|338|Will| 28|    180|
|358|Will| 52|    276|
|387|Will| 43|    335|
|421|Will| 40|    261|
|423|Will| 44|    388|
+---+----+---+-------+

In [64]:
from pyspark.sql import SparkSession

In [65]:

spark = SparkSession.builder.appName("Basics").getOrCreate()

In [74]:
df = spark.read.csv("file:///home/icpl12900/Desktop/assignments/fakefriends.csv")

In [75]:
df.printSchema()

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)

In [78]:
df = spark.read.csv("file:///home/icpl12900/Desktop/assignments/fakefriends.csv",inferSchema=True)
#it give data type according to value in that column

In [79]:
df.printSchema()

root
 |-- _c0: integer (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: integer (nullable = true)
 |-- _c3: integer (nullable = true)

In [76]:
df = spark.read.csv("file:///home/icpl12900/Desktop/assignments/fakefriends.csv",inferSchema=True,header=True)
#header = True means return 1st row value as header if header is not there

In [77]:
df.printSchema()

root
 |-- 0: integer (nullable = true)
 |-- Will: string (nullable = true)
 |-- 33: integer (nullable = true)
 |-- 385: integer (nullable = true)

In [81]:
df.show()

+---+--------+---+---+
|_c0|     _c1|_c2|_c3|
+---+--------+---+---+
|  0|    Will| 33|385|
|  1|Jean-Luc| 26|  2|
|  2|    Hugh| 55|221|
|  3|  Deanna| 40|465|
|  4|   Quark| 68| 21|
|  5|  Weyoun| 59|318|
|  6|  Gowron| 37|220|
|  7|    Will| 54|307|
|  8|  Jadzia| 38|380|
|  9|    Hugh| 27|181|
| 10|     Odo| 53|191|
| 11|     Ben| 57|372|
| 12|   Keiko| 54|253|
| 13|Jean-Luc| 56|444|
| 14|    Hugh| 43| 49|
| 15|     Rom| 36| 49|
| 16|  Weyoun| 22|323|
| 17|     Odo| 35| 13|
| 18|Jean-Luc| 45|455|
| 19|  Geordi| 60|246|
+---+--------+---+---+
only showing top 20 rows

In [82]:
df.filter("_c0  < 5").show()

+---+--------+---+---+
|_c0|     _c1|_c2|_c3|
+---+--------+---+---+
|  0|    Will| 33|385|
|  1|Jean-Luc| 26|  2|
|  2|    Hugh| 55|221|
|  3|  Deanna| 40|465|
|  4|   Quark| 68| 21|
+---+--------+---+---+

In [84]:
df.filter("_c0  < 5").select(['_c1','_c2']).show()

+--------+---+
|     _c1|_c2|
+--------+---+
|    Will| 33|
|Jean-Luc| 26|
|    Hugh| 55|
|  Deanna| 40|
|   Quark| 68|
+--------+---+

In [85]:
df.filter(df['_c0']  < 5).select(['_c1','_c2']).show()

+--------+---+
|     _c1|_c2|
+--------+---+
|    Will| 33|
|Jean-Luc| 26|
|    Hugh| 55|
|  Deanna| 40|
|   Quark| 68|
+--------+---+

In [86]:
df.filter((df['_c0']  < 5) & (df['_c0']>2)).select(['_c0','_c1','_c2']).show()

+---+------+---+
|_c0|   _c1|_c2|
+---+------+---+
|  3|Deanna| 40|
|  4| Quark| 68|
+---+------+---+

In [91]:
result1 = df.filter(df['_c0']  == 5).select(['_c1','_c2']).show()
#when we do .show() the it show the result and it not store that result in any variable

+------+---+
|   _c1|_c2|
+------+---+
|Weyoun| 59|
+------+---+

In [92]:
result1

In [93]:
result = df.filter(df['_c0']  == 5).select(['_c1','_c2']).collect()
#but when we do .collect() then it store result in variable

In [94]:
type(result)

list

In [95]:
result

[Row(_c1=u'Weyoun', _c2=59)]

In [102]:
result[0]

Row(_c1=u'Weyoun', _c2=59)

In [103]:
result[0][1]

59

In [104]:
type(result[0])

pyspark.sql.types.Row

In [107]:
row = result[0]

In [110]:
row.asDict()
#it create dictionary from value in dataframe

{'_c1': u'Weyoun', '_c2': 59}

In [111]:
row['_c1']

u'Weyoun'

### GROUP BY

In [116]:
df.groupBy('_c1').sum().show() 
#it do sum of all integer columns

+--------+--------+--------+--------+
|     _c1|sum(_c0)|sum(_c2)|sum(_c3)|
+--------+--------+--------+--------+
|    Data|    7470|    1084|    7192|
| Beverly|    5040|     811|    6128|
|    Hugh|    4725|     993|    5005|
|   Dukat|    4987|     877|    5317|
|Jean-Luc|    3020|     779|    4891|
|     Nog|    6401|     933|    5399|
|     Odo|    2800|     638|    4208|
|  Kasidy|    4381|     738|    4282|
|  Guinan|    3322|     556|    3025|
|   Leeta|    3397|     624|    3909|
|     Rom|    2734|     596|    2903|
|  Geordi|    4906|     887|    4728|
|   Brunt|    5934|     941|    4805|
|  Deanna|    4161|     762|    3479|
|     Ben|    3971|     814|    4888|
|  Weyoun|    4119|     567|    3677|
|   Miles|    1932|     369|    1942|
|    Will|    4204|     748|    5318|
|  Julian|    3229|     476|    2279|
| Lwaxana|    3455|     498|    2940|
+--------+--------+--------+--------+
only showing top 20 rows

In [117]:
df.groupBy('_c1').sum('_c0').show()
#it do sum of only _c0 column and return _c1 and _c0 column

+--------+--------+
|     _c1|sum(_c0)|
+--------+--------+
|    Data|    7470|
| Beverly|    5040|
|    Hugh|    4725|
|   Dukat|    4987|
|Jean-Luc|    3020|
|     Nog|    6401|
|     Odo|    2800|
|  Kasidy|    4381|
|  Guinan|    3322|
|   Leeta|    3397|
|     Rom|    2734|
|  Geordi|    4906|
|   Brunt|    5934|
|  Deanna|    4161|
|     Ben|    3971|
|  Weyoun|    4119|
|   Miles|    1932|
|    Will|    4204|
|  Julian|    3229|
| Lwaxana|    3455|
+--------+--------+
only showing top 20 rows

In [118]:
df.groupBy('_c1').count().show() 
#it count no of rows for each name

+--------+-----+
|     _c1|count|
+--------+-----+
|    Data|   25|
| Beverly|   20|
|    Hugh|   20|
|   Dukat|   21|
|Jean-Luc|   16|
|     Nog|   22|
|     Odo|   15|
|  Kasidy|   19|
|  Guinan|   12|
|   Leeta|   15|
|     Rom|   12|
|  Geordi|   20|
|   Brunt|   22|
|  Deanna|   17|
|     Ben|   17|
|  Weyoun|   15|
|   Miles|   10|
|    Will|   19|
|  Julian|   12|
| Lwaxana|   12|
+--------+-----+
only showing top 20 rows

In [119]:
df.groupBy('_c1').min().show() 
#find minimum of each name

+--------+--------+--------+--------+
|     _c1|min(_c0)|min(_c2)|min(_c3)|
+--------+--------+--------+--------+
|    Data|      78|      18|      61|
| Beverly|      35|      18|      92|
|    Hugh|       2|      23|      49|
|   Dukat|      33|      18|      18|
|Jean-Luc|       1|      26|       2|
|     Nog|      29|      19|       1|
|     Odo|      10|      26|      13|
|  Kasidy|      36|      18|       2|
|  Guinan|      43|      31|      74|
|   Leeta|      27|      22|       7|
|     Rom|      15|      34|       2|
|  Geordi|      19|      20|      21|
|   Brunt|      42|      19|       5|
|  Deanna|       3|      23|      22|
|     Ben|      11|      21|      73|
|  Weyoun|       5|      21|      38|
|   Miles|      21|      19|      10|
|    Will|       0|      19|       6|
|  Julian|      24|      20|       1|
| Lwaxana|      51|      25|      10|
+--------+--------+--------+--------+
only showing top 20 rows

### agg

In [120]:
df.agg({'_c0':'sum'}).show()
#_c0 is name of column and sum is operation on that column
#in df.agg we give name of column and operation that we want to perform on that column

+--------+
|sum(_c0)|
+--------+
|  124750|
+--------+

#### Use both function together

In [124]:
group_data = df.groupBy('_c1')

In [125]:
group_data.agg({'_c0':'max'}).show()

+--------+--------+
|     _c1|max(_c0)|
+--------+--------+
|    Data|     495|
| Beverly|     464|
|    Hugh|     493|
|   Dukat|     492|
|Jean-Luc|     476|
|     Nog|     488|
|     Odo|     489|
|  Kasidy|     494|
|  Guinan|     445|
|   Leeta|     499|
|     Rom|     491|
|  Geordi|     480|
|   Brunt|     487|
|  Deanna|     470|
|     Ben|     482|
|  Weyoun|     467|
|   Miles|     407|
|    Will|     423|
|  Julian|     453|
| Lwaxana|     497|
+--------+--------+
only showing top 20 rows

In [126]:
from pyspark.sql.functions import countDistinct,avg

In [127]:
df.select(avg('_c0')).show()

+--------+
|avg(_c0)|
+--------+
|   249.5|
+--------+

In [128]:
df.select(countDistinct('_c0')).show()

+-------------------+
|count(DISTINCT _c0)|
+-------------------+
|                500|
+-------------------+

In [129]:
df.select(avg('_c0').alias('average')).show()

+-------+
|average|
+-------+
|  249.5|
+-------+

##### orderBy

In [130]:
df.show()

+---+--------+---+---+
|_c0|     _c1|_c2|_c3|
+---+--------+---+---+
|  0|    Will| 33|385|
|  1|Jean-Luc| 26|  2|
|  2|    Hugh| 55|221|
|  3|  Deanna| 40|465|
|  4|   Quark| 68| 21|
|  5|  Weyoun| 59|318|
|  6|  Gowron| 37|220|
|  7|    Will| 54|307|
|  8|  Jadzia| 38|380|
|  9|    Hugh| 27|181|
| 10|     Odo| 53|191|
| 11|     Ben| 57|372|
| 12|   Keiko| 54|253|
| 13|Jean-Luc| 56|444|
| 14|    Hugh| 43| 49|
| 15|     Rom| 36| 49|
| 16|  Weyoun| 22|323|
| 17|     Odo| 35| 13|
| 18|Jean-Luc| 45|455|
| 19|  Geordi| 60|246|
+---+--------+---+---+
only showing top 20 rows

In [133]:
df.orderBy('_c2').show()
#in ascending order

+---+-------+---+---+
|_c0|    _c1|_c2|_c3|
+---+-------+---+---+
|106|Beverly| 18|499|
|439|   Data| 18|417|
|377|Beverly| 18|418|
|444|  Keiko| 18|472|
|494| Kasidy| 18|194|
|115|  Dukat| 18|397|
|341|   Data| 18|326|
|404| Kasidy| 18| 24|
| 21|  Miles| 19|268|
|304|   Will| 19|404|
|136|   Will| 19|335|
|133|  Quark| 19|265|
|373|  Quark| 19|272|
|366|  Keiko| 19|119|
|409|    Nog| 19|267|
| 52|Beverly| 19|269|
|225|   Elim| 19|106|
|492|  Dukat| 19| 36|
| 54|  Brunt| 19|  5|
| 48|    Nog| 20|  1|
+---+-------+---+---+
only showing top 20 rows

In [134]:
df.orderBy(df['_c2'].desc()).show()
#in descinding order

+---+--------+---+---+
|_c0|     _c1|_c2|_c3|
+---+--------+---+---+
| 99|   Keiko| 69|491|
|205|    Morn| 69|236|
|253|   Leeta| 69|116|
| 97|   Nerys| 69|361|
|354|  Kasidy| 69| 15|
|383|    Data| 69|148|
|116|     Ben| 69| 75|
|397|   Quark| 69|470|
|487|   Brunt| 69|431|
| 62|   Keiko| 69|  9|
|  4|   Quark| 68| 21|
|170|Jean-Luc| 68|490|
|258|    Worf| 68|217|
|120|Jean-Luc| 68|264|
|168|  Martok| 68|112|
|232|    Worf| 68|481|
|310|     Odo| 68|189|
|428| Lwaxana| 68|423|
|361|    Worf| 68|206|
|374|     Nog| 68|293|
+---+--------+---+---+
only showing top 20 rows

In [136]:
df.orderBy('_c1').show()
#we can do orderBy on string

+---+-------+---+---+
|_c0|    _c1|_c2|_c3|
+---+-------+---+---+
| 84|    Ben| 28|311|
|134|    Ben| 45|340|
|118|    Ben| 28|304|
| 11|    Ben| 57|372|
|183|    Ben| 47|488|
| 25|    Ben| 21|445|
|297|    Ben| 45|395|
|333|    Ben| 29|207|
|391|    Ben| 64|309|
|406|    Ben| 57|121|
|422|    Ben| 67|292|
|475|    Ben| 52|446|
|482|    Ben| 48|146|
|195|    Ben| 30|376|
| 88|    Ben| 66|188|
|211|    Ben| 61| 73|
|116|    Ben| 69| 75|
|149|Beverly| 49|340|
|106|Beverly| 18|499|
|269|Beverly| 55|289|
+---+-------+---+---+
only showing top 20 rows

### DROP MISSING VALUES

In [144]:
df = spark.read.csv("file:///home/icpl12900/Desktop/data_files/missing_data.csv")

In [145]:
df.show()

+---+---------+-------+----+----+
|_c0|      _c1|    _c2| _c3| _c4|
+---+---------+-------+----+----+
| id|     name|college|date|year|
|  1|pratiksha|   coep|  11|null|
|  2|    sayli|   null|  11|2012|
|  3|     anki|   vjti|null|2013|
|  4|      abc|   coep|  11|null|
|  5|      xyz|   null|null|2012|
+---+---------+-------+----+----+

In [146]:
df.na.drop().show()
#it drop row if it have na i.e null value in it

+---+----+-------+----+----+
|_c0| _c1|    _c2| _c3| _c4|
+---+----+-------+----+----+
| id|name|college|date|year|
+---+----+-------+----+----+

In [158]:
df.na.drop(thresh=2).show()
#here we give parameter thresh, if any row have atleast 2 null value then drop that row

+---+---------+-------+----+----+
|_c0|      _c1|    _c2| _c3| _c4|
+---+---------+-------+----+----+
| id|     name|college|date|year|
|  1|pratiksha|   coep|  11|null|
|  2|    sayli|   null|  11|2012|
|  3|     anki|   vjti|null|2013|
|  4|      abc|   coep|  11|null|
|  5|      xyz|   null|null|2012|
+---+---------+-------+----+----+

In [154]:
df.na.drop(how='any').show()
#drop row if it have any null value

+---+----+-------+----+----+
|_c0| _c1|    _c2| _c3| _c4|
+---+----+-------+----+----+
| id|name|college|date|year|
+---+----+-------+----+----+

In [159]:
df.na.drop(how='all').show()
#drop row if it have all null value

+---+---------+-------+----+----+
|_c0|      _c1|    _c2| _c3| _c4|
+---+---------+-------+----+----+
| id|     name|college|date|year|
|  1|pratiksha|   coep|  11|null|
|  2|    sayli|   null|  11|2012|
|  3|     anki|   vjti|null|2013|
|  4|      abc|   coep|  11|null|
|  5|      xyz|   null|null|2012|
+---+---------+-------+----+----+

In [161]:
df.na.drop(subset=['_c2']).show()
#here we give subset i.e if that subset means columns given in that subset is contain null value then drop that row
# and if other coulumn instead of that subset column contain null value then keep it is as

+---+---------+-------+----+----+
|_c0|      _c1|    _c2| _c3| _c4|
+---+---------+-------+----+----+
| id|     name|college|date|year|
|  1|pratiksha|   coep|  11|null|
|  3|     anki|   vjti|null|2013|
|  4|      abc|   coep|  11|null|
+---+---------+-------+----+----+

In [163]:
from pyspark.sql.functions import mean

In [174]:
mean_val = df.select(mean(df['_c0'])).collect()

TypeError: int() argument must be a string or a number, not 'list'

In [167]:
mean_val
#without index it return list

[Row(avg(_c0)=3.0)]

In [170]:
mean_val[0]
#with 0 index it return 1st value in list

Row(avg(_c0)=3.0)

In [175]:
mean_val = int(mean_val[0][0])
#with [0][0] return 1st value

In [178]:
df.na.fill(mean_val,['_c0']).show()
#it fill null value at column _c0 with mean value

+---+---------+-------+----+----+
|_c0|      _c1|    _c2| _c3| _c4|
+---+---------+-------+----+----+
| id|     name|college|date|year|
|  1|pratiksha|   coep|  11|null|
|  2|    sayli|   null|  11|2012|
|  3|     anki|   vjti|null|2013|
|  4|      abc|   coep|  11|null|
|  5|      xyz|   null|null|2012|
+---+---------+-------+----+----+

In [179]:
df.na.fill(int(df.select(mean(df['_c0'])).collect()[0][0]),['_c0']).show()
#it also do same operation

+---+---------+-------+----+----+
|_c0|      _c1|    _c2| _c3| _c4|
+---+---------+-------+----+----+
| id|     name|college|date|year|
|  1|pratiksha|   coep|  11|null|
|  2|    sayli|   null|  11|2012|
|  3|     anki|   vjti|null|2013|
|  4|      abc|   coep|  11|null|
|  5|      xyz|   null|null|2012|
+---+---------+-------+----+----+

In [180]:
df.show()

+---+---------+-------+----+----+
|_c0|      _c1|    _c2| _c3| _c4|
+---+---------+-------+----+----+
| id|     name|college|date|year|
|  1|pratiksha|   coep|  11|null|
|  2|    sayli|   null|  11|2012|
|  3|     anki|   vjti|null|2013|
|  4|      abc|   coep|  11|null|
|  5|      xyz|   null|null|2012|
+---+---------+-------+----+----+

In [185]:
df.na.fill('0').show()

+---+---------+-------+----+----+
|_c0|      _c1|    _c2| _c3| _c4|
+---+---------+-------+----+----+
| id|     name|college|date|year|
|  1|pratiksha|   coep|  11|   0|
|  2|    sayli|      0|  11|2012|
|  3|     anki|   vjti|   0|2013|
|  4|      abc|   coep|  11|   0|
|  5|      xyz|      0|   0|2012|
+---+---------+-------+----+----+

In [183]:
df.printSchema()

root
 |-- _c0: string (nullable = true)
 |-- _c1: string (nullable = true)
 |-- _c2: string (nullable = true)
 |-- _c3: string (nullable = true)
 |-- _c4: string (nullable = true)

### some operations with JSON data

In [199]:
df_json = spark.read.json("file:///home/icpl12900/Desktop/2015-summary.json")

In [200]:
df_json.show()

+--------------------+-------------------+-----+
|   DEST_COUNTRY_NAME|ORIGIN_COUNTRY_NAME|count|
+--------------------+-------------------+-----+
|       United States|            Romania|   15|
|       United States|            Croatia|    1|
|       United States|            Ireland|  344|
|               Egypt|      United States|   15|
|       United States|              India|   62|
|       United States|          Singapore|    1|
|       United States|            Grenada|   62|
|          Costa Rica|      United States|  588|
|             Senegal|      United States|   40|
|             Moldova|      United States|    1|
|       United States|       Sint Maarten|  325|
|       United States|   Marshall Islands|   39|
|              Guyana|      United States|   64|
|               Malta|      United States|    1|
|            Anguilla|      United States|   41|
|             Bolivia|      United States|   30|
|       United States|           Paraguay|    6|
|             Algeria|      United States|    4|
|Turks and Caicos ...|      United States|  230|
|       United States|          Gibraltar|    1|
+--------------------+-------------------+-----+
only showing top 20 rows

## TIME ZONE

In [1]:
from pyspark.sql.functions import (dayofmonth,hour,year,month,format_number,date_format)

In [30]:
df = spark.read.csv("file:///home/icpl12900/Desktop/assignments/Crimes_-_2001_to_present.csv",inferSchema=True,header=True)

In [31]:
df.show()

+--------+-----------+--------------------+--------------------+----+--------------------+--------------------+--------------------+------+--------+----+--------+----+--------------+--------+------------+------------+----+--------------------+------------+-------------+--------------------+
|      ID|Case Number|                Date|               Block|IUCR|        Primary Type|         Description|Location Description|Arrest|Domestic|Beat|District|Ward|Community Area|FBI Code|X Coordinate|Y Coordinate|Year|          Updated On|    Latitude|    Longitude|            Location|
+--------+-----------+--------------------+--------------------+----+--------------------+--------------------+--------------------+------+--------+----+--------+----+--------------+--------+------------+------------+----+--------------------+------------+-------------+--------------------+
|10000092|   HY189866|03/18/2015 07:44:...|     047XX W OHIO ST|041A|             BATTERY| AGGRAVATED: HANDGUN|              STREET| false|   false|1111|      11|  28|            25|     04B|     1144606|     1903566|2015|02/10/2018 03:50:...|41.891398861|-87.744384567|(41.891398861, -8...|
|10000094|   HY190059|03/18/2015 11:00:...|066XX S MARSHFIEL...|4625|       OTHER OFFENSE|    PAROLE VIOLATION|              STREET|  true|   false| 725|       7|  15|            67|      26|     1166468|     1860715|2015|02/10/2018 03:50:...|41.773371528|-87.665319468|(41.773371528, -8...|
|10000095|   HY190052|03/18/2015 10:45:...|044XX S LAKE PARK...|0486|             BATTERY|DOMESTIC BATTERY ...|           APARTMENT| false|    true| 222|       2|   4|            39|     08B|     1185075|     1875622|2015|02/10/2018 03:50:...| 41.81386068|-87.596642837|(41.81386068, -87...|
|10000096|   HY190054|03/18/2015 10:30:...|051XX S MICHIGAN AVE|0460|             BATTERY|              SIMPLE|           APARTMENT| false|   false| 225|       2|   3|            40|     08B|     1178033|     1870804|2015|02/10/2018 03:50:...|41.800802415|-87.622619343|(41.800802415, -8...|
|10000097|   HY189976|03/18/2015 09:00:...|    047XX W ADAMS ST|031A|             ROBBERY|      ARMED: HANDGUN|            SIDEWALK| false|   false|1113|      11|  28|            25|      03|     1144920|     1898709|2015|02/10/2018 03:50:...|41.878064761|-87.743354013|(41.878064761, -8...|
|10000098|   HY190032|03/18/2015 10:00:...| 049XX S DREXEL BLVD|0460|             BATTERY|              SIMPLE|           APARTMENT| false|   false| 223|       2|   4|            39|     08B|     1183018|     1872537|2015|02/10/2018 03:50:...|41.805443345|-87.604283976|(41.805443345, -8...|
|10000099|   HY190047|03/18/2015 11:00:...|   070XX S MORGAN ST|0486|             BATTERY|DOMESTIC BATTERY ...|           APARTMENT| false|    true| 733|       7|  17|            68|     08B|     1170859|     1858210|2015|02/10/2018 03:50:...|41.766402779|-87.649296123|(41.766402779, -8...|
|10000100|   HY189988|03/18/2015 09:35:...| 042XX S PRAIRIE AVE|0486|             BATTERY|DOMESTIC BATTERY ...|           APARTMENT| false|    true| 213|       2|   3|            38|     08B|     1178746|     1876914|2015|02/10/2018 03:50:...|41.817552577|-87.619818523|(41.817552577, -8...|
|10000101|   HY190020|03/18/2015 10:09:...| 036XX S WOLCOTT AVE|1811|           NARCOTICS|POSS: CANNABIS 30...|              STREET|  true|   false| 912|       9|  11|            59|      18|     1164279|     1880656|2015|02/10/2018 03:50:...|41.828138428|-87.672782106|(41.828138428, -8...|
|10000104|   HY189964|03/18/2015 09:25:...| 097XX S PRAIRIE AVE|0460|             BATTERY|              SIMPLE|RESIDENCE PORCH/H...| false|   false| 511|       5|   6|            49|     08B|     1179637|     1840444|2015|02/10/2018 03:50:...| 41.71745472|-87.617663257|(41.71745472, -87...|
|10000105|   HY189984|03/18/2015 09:30:...|130XX S DR MARTIN...|1320|     CRIMINAL DAMAGE|          TO VEHICLE|PARKING LOT/GARAG...| false|   false| 533|       5|   9|            54|      14|     1180907|     1818839|2015|02/10/2018 03:50:...|41.658138493|-87.613672862|(41.658138493, -8...|
|10000108|   HY189719|03/15/2015 04:10:...|078XX S VINCENNES...|2825|       OTHER OFFENSE|HARASSMENT BY TEL...|CTA GARAGE / OTHE...| false|    true| 623|       6|  17|            69|      26|     1175130|     1853144|2015|02/10/2018 03:50:...|41.752406801|-87.633792381|(41.752406801, -8...|
|10000109|   HY189966|03/18/2015 09:14:...|086XX S EXCHANGE AVE|143A|   WEAPONS VIOLATION|UNLAWFUL POSS OF ...|DRIVEWAY - RESIDE...|  true|   false| 423|       4|  10|            46|      15|     1197309|     1848290|2015|02/10/2018 03:50:...|41.738563465|-87.552678593|(41.738563465, -8...|
|10000110|   HY190056|03/18/2015 10:50:...| 014XX S ASHLAND AVE|0460|             BATTERY|              SIMPLE|            SIDEWALK| false|   false|1233|      12|   2|            28|     08B|     1165950|     1893388|2015|02/10/2018 03:50:...| 41.86304084|-87.666288555|(41.86304084, -87...|
|10000111|   HY190019|03/18/2015 10:31:...| 051XX W CHICAGO AVE|0860|               THEFT|        RETAIL THEFT|         GAS STATION|  true|   false|1531|      15|  37|            25|      06|     1141741|     1904839|2015|02/10/2018 03:50:...|41.894945606|-87.754874977|(41.894945606, -8...|
|10000112|   HY189725|03/18/2015 12:55:...|077XX S KINGSTON AVE|0610|            BURGLARY|      FORCIBLE ENTRY|           APARTMENT| false|   false| 421|       4|   7|            43|      05|     1194535|     1854110|2015|02/10/2018 03:50:...|41.754602618|-87.562650741|(41.754602618, -8...|
|10000114|   HY190071|03/18/2015 08:00:...|   024XX W NORTH AVE|0910| MOTOR VEHICLE THEFT|          AUTOMOBILE|               OTHER| false|   false|1423|      14|   1|            24|      07|     1159959|     1910569|2015|02/10/2018 03:50:...|41.910312648|-87.687806494|(41.910312648, -8...|
|10000115|   HY190036|03/18/2015 09:00:...| 069XX S LOOMIS BLVD|0890|               THEFT|       FROM BUILDING|  GROCERY FOOD STORE| false|   false| 734|       7|  17|            67|      06|     1168192|     1858832|2015|02/10/2018 03:50:...|41.768167414|-87.659053795|(41.768167414, -8...|
|10000116|   HY190063|03/18/2015 10:56:...|105XX S LAFAYETTE...|0470|PUBLIC PEACE VIOL...|    RECKLESS CONDUCT|               ALLEY|  true|   false| 512|       5|  34|            49|      24|     1177790|     1835106|2015|02/10/2018 03:50:...| 41.70284845|-87.624588931|(41.70284845, -87...|
|10000117|   HY190068|03/18/2015 10:45:...| 087XX S KIMBARK AVE|0890|               THEFT|       FROM BUILDING|       BAR OR TAVERN| false|   false| 412|       4|   8|            48|      06|     1186312|     1847473|2015|02/10/2018 03:50:...|41.736588206| -87.59299436|(41.736588206, -8...|
+--------+-----------+--------------------+--------------------+----+--------------------+--------------------+--------------------+------+--------+----+--------+----+--------------+--------+------------+------------+----+--------------------+------------+-------------+--------------------+
only showing top 20 rows

In [32]:
df.head(1)

[Row(ID=10000092, Case Number=u'HY189866', Date=u'03/18/2015 07:44:00 PM', Block=u'047XX W OHIO ST', IUCR=u'041A', Primary Type=u'BATTERY', Description=u'AGGRAVATED: HANDGUN', Location Description=u'STREET', Arrest=False, Domestic=False, Beat=1111, District=11, Ward=28, Community Area=25, FBI Code=u'04B', X Coordinate=1144606, Y Coordinate=1903566, Year=2015, Updated On=u'02/10/2018 03:50:01 PM', Latitude=41.891398861, Longitude=-87.744384567, Location=u'(41.891398861, -87.744384567)')]

In [27]:
date = df.select('Date')

In [28]:
date

DataFrame[Date: string]

TypeError: int() argument must be a string or a number, not 'DataFrame'

In [34]:
df.select(dayofmonth(df['Date'])).show()

+----------------+
|dayofmonth(Date)|
+----------------+
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
|            null|
+----------------+
only showing top 20 rows

In [35]:
df.select(month(df['Date'])).show()

+-----------+
|month(Date)|
+-----------+
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
|       null|
+-----------+
only showing top 20 rows

In [210]:
df.select(year(df['_c2'])).show()

+---------+
|year(_c2)|
+---------+
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
|     null|
+---------+
only showing top 20 rows

In [47]:
df.describe()

DataFrame[summary: string, ID: string, Case Number: string, Date: string, Block: string, IUCR: string, Primary Type: string, Description: string, Location Description: string, Beat: string, District: string, Ward: string, Community Area: string, FBI Code: string, X Coordinate: string, Y Coordinate: string, Year: string, Updated On: string, Latitude: string, Longitude: string, Location: string]

In [37]:
result = df.describe()

In [48]:
result.select(result['summary'],format_number(result['Date'].cast('int'),0).alias('date')).show()

+-------+---------+
|summary|     date|
+-------+---------+
|  count|6,673,140|
|   mean|     null|
| stddev|     null|
|    min|     null|
|    max|     null|
+-------+---------+